kcuzner/teensy-oscilloscope/scope-teensy/include/MK21F12.h
/*
** ###################################################################
**     Compilers:           ARM Compiler
**                          Freescale C/C++ for Embedded ARM
**                          GNU C Compiler
**                          IAR ANSI C/C++ Compiler for ARM
**
**     Reference manual:    K21P144M100SF5RM, Rev.2, Apr 2013
**     Version:             rev. 1.7, 2014-02-18
**
**     Abstract:
**         This header file implements peripheral memory map for MK21F12
**         processor.
**
**     Copyright: 1997 - 2014 Freescale, Inc. All Rights Reserved.
**
**     http:                 www.freescale.com
**     mail:                 support@freescale.com
**
**     Revisions:
**     - rev. 1.0 (2012-11-12)
**         Initial version.
**     - rev. 1.1 (2012-12-04)
**         Update according to reference manual rev.1
**     - rev. 1.2 (2013-01-21)
**         Registers related to security features removed.
**     - rev. 1.3 (2013-04-05)
**         Changed start of doxygen comment.
**     - rev. 1.4 (2013-04-23)
**         System timer registers added.
**     - rev. 1.5 (2013-05-16)
**         Update according to reference manual rev.2
**     - rev. 1.6 (2013-10-29)
**         Definition of BITBAND macros updated to support peripherals with 32-bit acces disabled.
**     - rev. 1.7 (2014-02-18)
**         UART0 module - LON registers removed.
**
** ###################################################################
*/

/*!
 * @file MK21F12.h
 * @version 1.7
 * @date 2014-02-18
 * @brief Peripheral memory map for MK21F12
 *
 * This header file implements peripheral memory map for MK21F12 processor.
 */


/* ----------------------------------------------------------------------------
   -- MCU activation
   ---------------------------------------------------------------------------- */

/* Prevention from multiple including the same memory map */
#if !defined(MCU_MK21F12)  /* Check if memory map has not been already included */
#define MCU_MK21F12

/* Check if another memory map has not been also included */
#if (defined(MCU_ACTIVE))
  #error MK21F12 memory map: There is already included another memory map. Only one memory map can be included.
#endif /* (defined(MCU_ACTIVE)) */
#define MCU_ACTIVE

#include <stdint.h>

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0100u
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0007u

/**
 * @brief Macro to calculate address of an aliased word in the peripheral
 *        bitband area for a peripheral register and bit (bit band region 0x40000000 to
 *        0x400FFFFF).
 * @param Reg Register to access.
 * @param Bit Bit number to access.
 * @return  Address of the aliased word in the peripheral bitband area.
 */
#define BITBAND_REGADDR(Reg,Bit) (0x42000000u + (32u*((uint32_t)&(Reg) - (uint32_t)0x40000000u)) + (4u*((uint32_t)(Bit))))
/**
 * @brief Macro to access a single bit of a peripheral register (bit band region
 *        0x40000000 to 0x400FFFFF) using the bit-band alias region access. Can
 *        be used for peripherals with 32bit access allowed.
 * @param Reg Register to access.
 * @param Bit Bit number to access.
 * @return Value of the targeted bit in the bit band region.
 */
#define BITBAND_REG32(Reg,Bit) (*((uint32_t volatile*)(BITBAND_REGADDR(Reg,Bit))))
#define BITBAND_REG(Reg,Bit) (BITBAND_REG32(Reg,Bit))
/**
 * @brief Macro to access a single bit of a peripheral register (bit band region
 *        0x40000000 to 0x400FFFFF) using the bit-band alias region access. Can
 *        be used for peripherals with 16bit access allowed.
 * @param Reg Register to access.
 * @param Bit Bit number to access.
 * @return Value of the targeted bit in the bit band region.
 */
#define BITBAND_REG16(Reg,Bit) (*((uint16_t volatile*)(BITBAND_REGADDR(Reg,Bit))))
/**
 * @brief Macro to access a single bit of a peripheral register (bit band region
 *        0x40000000 to 0x400FFFFF) using the bit-band alias region access. Can
 *        be used for peripherals with 8bit access allowed.
 * @param Reg Register to access.
 * @param Bit Bit number to access.
 * @return Value of the targeted bit in the bit band region.
 */
#define BITBAND_REG8(Reg,Bit) (*((uint8_t volatile*)(BITBAND_REGADDR(Reg,Bit))))

/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
typedef enum {
  INT_Initial_Stack_Pointer    = 0,                /**< Initial Stack Pointer */
  INT_Initial_Program_Counter  = 1,                /**< Initial Program Counter */
  INT_NMI                      = 2,                /**< Non-maskable Interrupt (NMI) */
  INT_Hard_Fault               = 3,                /**< Hard Fault */
  INT_Mem_Manage_Fault         = 4,                /**< MemManage Fault */
  INT_Bus_Fault                = 5,                /**< Bus Fault */
  INT_Usage_Fault              = 6,                /**< Usage Fault */
  INT_Reserved7                = 7,                /**< Reserved interrupt 7 */
  INT_Reserved8                = 8,                /**< Reserved interrupt 8 */
  INT_Reserved9                = 9,                /**< Reserved interrupt 9 */
  INT_Reserved10               = 10,               /**< Reserved interrupt 10 */
  INT_SVCall                   = 11,               /**< Supervisor call (SVCall) */
  INT_DebugMonitor             = 12,               /**< Debug Monitor */
  INT_Reserved13               = 13,               /**< Reserved interrupt 13 */
  INT_PendableSrvReq           = 14,               /**< Pendable request for system service (PendableSrvReq) */
  INT_SysTick                  = 15,               /**< SysTick Interrupt */
  INT_DMA0                     = 16,               /**< DMA Channel 0 Transfer Complete */
  INT_DMA1                     = 17,               /**< DMA Channel 1 Transfer Complete */
  INT_DMA2                     = 18,               /**< DMA Channel 2 Transfer Complete */
  INT_DMA3                     = 19,               /**< DMA Channel 3 Transfer Complete */
  INT_DMA4                     = 20,               /**< DMA Channel 4 Transfer Complete */
  INT_DMA5                     = 21,               /**< DMA Channel 5 Transfer Complete */
  INT_DMA6                     = 22,               /**< DMA Channel 6 Transfer Complete */
  INT_DMA7                     = 23,               /**< DMA Channel 7 Transfer Complete */
  INT_DMA8                     = 24,               /**< DMA Channel 8 Transfer Complete */
  INT_DMA9                     = 25,               /**< DMA Channel 9 Transfer Complete */
  INT_DMA10                    = 26,               /**< DMA Channel 10 Transfer Complete */
  INT_DMA11                    = 27,               /**< DMA Channel 11 Transfer Complete */
  INT_DMA12                    = 28,               /**< DMA Channel 12 Transfer Complete */
  INT_DMA13                    = 29,               /**< DMA Channel 13 Transfer Complete */
  INT_DMA14                    = 30,               /**< DMA Channel 14 Transfer Complete */
  INT_DMA15                    = 31,               /**< DMA Channel 15 Transfer Complete */
  INT_DMA_Error                = 32,               /**< DMA Error Interrupt */
  INT_MCM                      = 33,               /**< Normal Interrupt */
  INT_FTFE                     = 34,               /**< FTFE Command complete interrupt */
  INT_Read_Collision           = 35,               /**< Read Collision Interrupt */
  INT_LVD_LVW                  = 36,               /**< Low Voltage Detect, Low Voltage Warning */
  INT_LLW                      = 37,               /**< Low Leakage Wakeup */
  INT_Watchdog                 = 38,               /**< WDOG Interrupt */
  INT_RNG                      = 39,               /**< RNG Interrupt */
  INT_I2C0                     = 40,               /**< I2C0 interrupt */
  INT_I2C1                     = 41,               /**< I2C1 interrupt */
  INT_SPI0                     = 42,               /**< SPI0 Interrupt */
  INT_SPI1                     = 43,               /**< SPI1 Interrupt */
  INT_I2S0_Tx                  = 44,               /**< I2S0 transmit interrupt */
  INT_I2S0_Rx                  = 45,               /**< I2S0 receive interrupt */
  INT_Reserved46               = 46,               /**< Reserved interrupt 46 */
  INT_UART0_RX_TX              = 47,               /**< UART0 Receive/Transmit interrupt */
  INT_UART0_ERR                = 48,               /**< UART0 Error interrupt */
  INT_UART1_RX_TX              = 49,               /**< UART1 Receive/Transmit interrupt */
  INT_UART1_ERR                = 50,               /**< UART1 Error interrupt */
  INT_UART2_RX_TX              = 51,               /**< UART2 Receive/Transmit interrupt */
  INT_UART2_ERR                = 52,               /**< UART2 Error interrupt */
  INT_UART3_RX_TX              = 53,               /**< UART3 Receive/Transmit interrupt */
  INT_UART3_ERR                = 54,               /**< UART3 Error interrupt */
  INT_ADC0                     = 55,               /**< ADC0 interrupt */
  INT_CMP0                     = 56,               /**< CMP0 interrupt */
  INT_CMP1                     = 57,               /**< CMP1 interrupt */
  INT_FTM0                     = 58,               /**< FTM0 fault, overflow and channels interrupt */
  INT_FTM1                     = 59,               /**< FTM1 fault, overflow and channels interrupt */
  INT_FTM2                     = 60,               /**< FTM2 fault, overflow and channels interrupt */
  INT_CMT                      = 61,               /**< CMT interrupt */
  INT_RTC                      = 62,               /**< RTC interrupt */
  INT_RTC_Seconds              = 63,               /**< RTC seconds interrupt */
  INT_PIT0                     = 64,               /**< PIT timer channel 0 interrupt */
  INT_PIT1                     = 65,               /**< PIT timer channel 1 interrupt */
  INT_PIT2                     = 66,               /**< PIT timer channel 2 interrupt */
  INT_PIT3                     = 67,               /**< PIT timer channel 3 interrupt */
  INT_PDB0                     = 68,               /**< PDB0 Interrupt */
  INT_USB0                     = 69,               /**< USB0 interrupt */
  INT_USBDCD                   = 70,               /**< USBDCD Interrupt */
  INT_Reserved71               = 71,               /**< Reserved interrupt 71 */
  INT_DAC0                     = 72,               /**< DAC0 interrupt */
  INT_MCG                      = 73,               /**< MCG Interrupt */
  INT_LPTimer                  = 74,               /**< LPTimer interrupt */
  INT_PORTA                    = 75,               /**< Port A interrupt */
  INT_PORTB                    = 76,               /**< Port B interrupt */
  INT_PORTC                    = 77,               /**< Port C interrupt */
  INT_PORTD                    = 78,               /**< Port D interrupt */
  INT_PORTE                    = 79,               /**< Port E interrupt */
  INT_SWI                      = 80,               /**< Software interrupt */
  INT_SPI2                     = 81,               /**< SPI2 Interrupt */
  INT_UART4_RX_TX              = 82,               /**< UART4 Receive/Transmit interrupt */
  INT_UART4_ERR                = 83,               /**< UART4 Error interrupt */
  INT_UART5_RX_TX              = 84,               /**< UART5 Receive/Transmit interrupt */
  INT_UART5_ERR                = 85,               /**< UART5 Error interrupt */
  INT_CMP2                     = 86,               /**< CMP2 interrupt */
  INT_FTM3                     = 87,               /**< FTM3 fault, overflow and channels interrupt */
  INT_DAC1                     = 88,               /**< DAC1 interrupt */
  INT_ADC1                     = 89,               /**< ADC1 interrupt */
  INT_I2C2                     = 90,               /**< I2C2 interrupt */
  INT_CAN0_ORed_Message_buffer = 91,               /**< CAN0 OR'd message buffers interrupt */
  INT_CAN0_Bus_Off             = 92,               /**< CAN0 bus off interrupt */
  INT_CAN0_Error               = 93,               /**< CAN0 error interrupt */
  INT_CAN0_Tx_Warning          = 94,               /**< CAN0 Tx warning interrupt */
  INT_CAN0_Rx_Warning          = 95,               /**< CAN0 Rx warning interrupt */
  INT_CAN0_Wake_Up             = 96,               /**< CAN0 wake up interrupt */
  INT_SDHC                     = 97                /**< SDHC interrupt */
} IRQInterruptIndex;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Peripheral type defines
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_defines Peripheral type defines
 * @{
 */


