kcuzner/teensy-oscilloscope/scope-teensy/include/MK21F12.h
/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #pragma pop
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_defines */


/* ----------------------------------------------------------------------------
   -- Backward Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Backward_Compatibility_Symbols Backward Compatibility
 * @{
 */

#define INT_FTFL                                 INT_FTFE
#define DMA_HRS_HRS4_MASK                        This_symbol_has_been_deprecated
#define DMA_HRS_HRS4_SHIFT                       This_symbol_has_been_deprecated
#define DMA_HRS_HRS5_MASK                        This_symbol_has_been_deprecated
#define DMA_HRS_HRS5_SHIFT                       This_symbol_has_been_deprecated
#define DMA_HRS_HRS6_MASK                        This_symbol_has_been_deprecated
#define DMA_HRS_HRS6_SHIFT                       This_symbol_has_been_deprecated
#define DMA_HRS_HRS7_MASK                        This_symbol_has_been_deprecated
#define DMA_HRS_HRS7_SHIFT                       This_symbol_has_been_deprecated
#define DMA_HRS_HRS8_MASK                        This_symbol_has_been_deprecated
#define DMA_HRS_HRS8_SHIFT                       This_symbol_has_been_deprecated
#define DMA_HRS_HRS9_MASK                        This_symbol_has_been_deprecated
#define DMA_HRS_HRS9_SHIFT                       This_symbol_has_been_deprecated
#define DMA_HRS_HRS10_MASK                       This_symbol_has_been_deprecated
#define DMA_HRS_HRS10_SHIFT                      This_symbol_has_been_deprecated
#define DMA_HRS_HRS11_MASK                       This_symbol_has_been_deprecated
#define DMA_HRS_HRS11_SHIFT                      This_symbol_has_been_deprecated
#define DMA_HRS_HRS12_MASK                       This_symbol_has_been_deprecated
#define DMA_HRS_HRS12_SHIFT                      This_symbol_has_been_deprecated
#define DMA_HRS_HRS13_MASK                       This_symbol_has_been_deprecated
#define DMA_HRS_HRS13_SHIFT                      This_symbol_has_been_deprecated
#define DMA_HRS_HRS14_MASK                       This_symbol_has_been_deprecated
#define DMA_HRS_HRS14_SHIFT                      This_symbol_has_been_deprecated
#define DMA_HRS_HRS15_MASK                       This_symbol_has_been_deprecated
#define DMA_HRS_HRS15_SHIFT                      This_symbol_has_been_deprecated
#define MCM_CR_REG(base)                         This_symbol_has_been_deprecated
#define MCM_FADR_REG(base)                       This_symbol_has_been_deprecated
#define MCM_FATR_REG(base)                       This_symbol_has_been_deprecated
#define MCM_FDR_REG(base)                        This_symbol_has_been_deprecated
#define MCM_CR                                   This_symbol_has_been_deprecated
#define MCM_FADR                                 This_symbol_has_been_deprecated
#define MCM_FATR                                 This_symbol_has_been_deprecated
#define MCM_FDR                                  This_symbol_has_been_deprecated
#define MCM_CR_SRAMUAP_MASK                      This_symbol_has_been_deprecated
#define MCM_CR_SRAMUAP_SHIFT                     This_symbol_has_been_deprecated
#define MCM_CR_SRAMUAP(x)                        This_symbol_has_been_deprecated
#define MCM_CR_SRAMUWP_MASK                      This_symbol_has_been_deprecated
#define MCM_CR_SRAMUWP_SHIFT                     This_symbol_has_been_deprecated
#define MCM_CR_SRAMLAP_MASK                      This_symbol_has_been_deprecated
#define MCM_CR_SRAMLAP_SHIFT                     This_symbol_has_been_deprecated
#define MCM_CR_SRAMLAP(x)                        This_symbol_has_been_deprecated
#define MCM_CR_SRAMLWP_MASK                      This_symbol_has_been_deprecated
#define MCM_CR_SRAMLWP_SHIFT                     This_symbol_has_been_deprecated
#define MCM_FADR_ADDRESS_MASK                    This_symbol_has_been_deprecated
#define MCM_FADR_ADDRESS_SHIFT                   This_symbol_has_been_deprecated
#define MCM_FADR_ADDRESS(x)                      This_symbol_has_been_deprecated
#define MCM_FATR_BEDA_MASK                       This_symbol_has_been_deprecated
#define MCM_FATR_BEDA_SHIFT                      This_symbol_has_been_deprecated
#define MCM_FATR_BEMD_MASK                       This_symbol_has_been_deprecated
#define MCM_FATR_BEMD_SHIFT                      This_symbol_has_been_deprecated
#define MCM_FATR_BESZ_MASK                       This_symbol_has_been_deprecated
#define MCM_FATR_BESZ_SHIFT                      This_symbol_has_been_deprecated
#define MCM_FATR_BESZ(x)                         This_symbol_has_been_deprecated
#define MCM_FATR_BEWT_MASK                       This_symbol_has_been_deprecated
#define MCM_FATR_BEWT_SHIFT                      This_symbol_has_been_deprecated
#define MCM_FATR_BEMN_MASK                       This_symbol_has_been_deprecated
#define MCM_FATR_BEMN_SHIFT                      This_symbol_has_been_deprecated
#define MCM_FATR_BEMN(x)                         This_symbol_has_been_deprecated
#define MCM_FATR_BEOVR_MASK                      This_symbol_has_been_deprecated
#define MCM_FATR_BEOVR_SHIFT                     This_symbol_has_been_deprecated
#define MCM_FDR_DATA_MASK                        This_symbol_has_been_deprecated
#define MCM_FDR_DATA_SHIFT                       This_symbol_has_been_deprecated
#define MCM_FDR_DATA(x)                          This_symbol_has_been_deprecated
#define PORT_DFER_REG(base)                      This_symbol_has_been_deprecated
#define PORT_DFCR_REG(base)                      This_symbol_has_been_deprecated
#define PORT_DFWR_REG(base)                      This_symbol_has_been_deprecated
#define PORTA_DFER                               This_symbol_has_been_deprecated
#define PORTA_DFCR                               This_symbol_has_been_deprecated
#define PORTA_DFWR                               This_symbol_has_been_deprecated
#define PORTB_DFER                               This_symbol_has_been_deprecated
#define PORTB_DFCR                               This_symbol_has_been_deprecated
#define PORTB_DFWR                               This_symbol_has_been_deprecated
#define PORTC_DFER                               This_symbol_has_been_deprecated
#define PORTC_DFCR                               This_symbol_has_been_deprecated
#define PORTC_DFWR                               This_symbol_has_been_deprecated
#define PORTD_DFER                               This_symbol_has_been_deprecated
#define PORTD_DFCR                               This_symbol_has_been_deprecated
#define PORTD_DFWR                               This_symbol_has_been_deprecated
#define PORTE_DFER                               This_symbol_has_been_deprecated
#define PORTE_DFCR                               This_symbol_has_been_deprecated
#define PORTE_DFWR                               This_symbol_has_been_deprecated
#define PORT_DFER_DFE_MASK                       This_symbol_has_been_deprecated
#define PORT_DFER_DFE_SHIFT                      This_symbol_has_been_deprecated
#define PORT_DFER_DFE(x)                         This_symbol_has_been_deprecated
#define PORT_DFCR_CS_MASK                        This_symbol_has_been_deprecated
#define PORT_DFCR_CS_SHIFT                       This_symbol_has_been_deprecated
#define PORT_DFWR_FILT_MASK                      This_symbol_has_been_deprecated
#define PORT_DFWR_FILT_SHIFT                     This_symbol_has_been_deprecated
#define PORT_DFWR_FILT(x)                        This_symbol_has_been_deprecated
#define SIM_SCGC5_LPTIMER_MASK                   SIM_SCGC5_LPTMR_MASK
#define SIM_SCGC5_LPTIMER_SHIFT                  SIM_SCGC5_LPTMR_SHIFT
#define SIM_SCGC6_FTFL_MASK                      SIM_SCGC6_FTF_MASK
#define SIM_SCGC6_FTFL_SHIFT                     SIM_SCGC6_FTF_SHIFT
#define USBDCD_TIMER2_REG(base)                  USBDCD_TIMER2_BC11_REG
#define USBDCD_TIMER2                            USBDCD_TIMER2_BC11
#define USBDCD_TIMER2_CHECK_DM_MASK              USBDCD_TIMER2_BC11_CHECK_DM_MASK
#define USBDCD_TIMER2_CHECK_DM_SHIFT             USBDCD_TIMER2_BC11_CHECK_DM_SHIFT
#define USBDCD_TIMER2_CHECK_DM(x)                USBDCD_TIMER2_BC11_CHECK_DM
#define USBDCD_TIMER2_TVDPSRC_CON_MASK           USBDCD_TIMER2_BC11_TVDPSRC_CON_MASK
#define USBDCD_TIMER2_TVDPSRC_CON_SHIFT          USBDCD_TIMER2_BC11_TVDPSRC_CON_SHIFT
#define USBDCD_TIMER2_TVDPSRC_CON(x)             USBDCD_TIMER2_BC11_TVDPSRC_CON(x)
#define UART_C6_REG(base)                        This_symbol_has_been_deprecated
#define UART_PCTH_REG(base)                      This_symbol_has_been_deprecated
#define UART_PCTL_REG(base)                      This_symbol_has_been_deprecated
#define UART_B1T_REG(base)                       This_symbol_has_been_deprecated
#define UART_SDTH_REG(base)                      This_symbol_has_been_deprecated
#define UART_SDTL_REG(base)                      This_symbol_has_been_deprecated
#define UART_PRE_REG(base)                       This_symbol_has_been_deprecated
#define UART_TPL_REG(base)                       This_symbol_has_been_deprecated
#define UART_IE_REG(base)                        This_symbol_has_been_deprecated
#define UART_WB_REG(base)                        This_symbol_has_been_deprecated
#define UART_S3_REG(base)                        This_symbol_has_been_deprecated
#define UART_S4_REG(base)                        This_symbol_has_been_deprecated
#define UART_RPL_REG(base)                       This_symbol_has_been_deprecated
#define UART_RPREL_REG(base)                     This_symbol_has_been_deprecated
#define UART_CPW_REG(base)                       This_symbol_has_been_deprecated
#define UART_RIDT_REG(base)                      This_symbol_has_been_deprecated
#define UART_TIDT_REG(base)                      This_symbol_has_been_deprecated
#define UART_AP7816A_T0_REG(base)                This_symbol_has_been_deprecated
#define UART_AP7816B_T0_REG(base)                This_symbol_has_been_deprecated
#define UART_WP7816A_T0_REG(base)                This_symbol_has_been_deprecated
#define UART_WP7816B_T0_REG(base)                This_symbol_has_been_deprecated
#define UART_WP7816A_T1_REG(base)                This_symbol_has_been_deprecated
#define UART_WP7816B_T1_REG(base)                This_symbol_has_been_deprecated
#define UART_WGP7816_T1_REG(base)                This_symbol_has_been_deprecated
#define UART_WP7816C_T1_REG(base)                This_symbol_has_been_deprecated
#define UART_IE7816_ADTE_MASK                    This_symbol_has_been_deprecated
#define UART_IE7816_ADTE_SHIFT                   This_symbol_has_been_deprecated
#define UART_IS7816_ADT_MASK                     This_symbol_has_been_deprecated
#define UART_IS7816_ADT_SHIFT                    This_symbol_has_been_deprecated
#define UART_WP7816_WTX_MASK                     This_symbol_has_been_deprecated
#define UART_WP7816_WTX_SHIFT                    This_symbol_has_been_deprecated
#define UART_WP7816_WTX(x)                       This_symbol_has_been_deprecated
#define UART_C6_CP_MASK                          This_symbol_has_been_deprecated
#define UART_C6_CP_SHIFT                         This_symbol_has_been_deprecated
#define UART_C6_CE_MASK                          This_symbol_has_been_deprecated
#define UART_C6_CE_SHIFT                         This_symbol_has_been_deprecated
#define UART_C6_TX709_MASK                       This_symbol_has_been_deprecated
#define UART_C6_TX709_SHIFT                      This_symbol_has_been_deprecated
#define UART_C6_EN709_MASK                       This_symbol_has_been_deprecated
#define UART_C6_EN709_SHIFT                      This_symbol_has_been_deprecated
#define UART_PCTH_PCTH_MASK                      This_symbol_has_been_deprecated
#define UART_PCTH_PCTH_SHIFT                     This_symbol_has_been_deprecated
#define UART_PCTH_PCTH(x)                        This_symbol_has_been_deprecated
#define UART_PCTL_PCTL_MASK                      This_symbol_has_been_deprecated
#define UART_PCTL_PCTL_SHIFT                     This_symbol_has_been_deprecated
#define UART_PCTL_PCTL(x)                        This_symbol_has_been_deprecated
#define UART_B1T_B1T_MASK                        This_symbol_has_been_deprecated
#define UART_B1T_B1T_SHIFT                       This_symbol_has_been_deprecated
#define UART_B1T_B1T(x)                          This_symbol_has_been_deprecated
#define UART_SDTH_SDTH_MASK                      This_symbol_has_been_deprecated
#define UART_SDTH_SDTH_SHIFT                     This_symbol_has_been_deprecated
#define UART_SDTH_SDTH(x)                        This_symbol_has_been_deprecated
#define UART_SDTL_SDTL_MASK                      This_symbol_has_been_deprecated
#define UART_SDTL_SDTL_SHIFT                     This_symbol_has_been_deprecated
#define UART_SDTL_SDTL(x)                        This_symbol_has_been_deprecated
#define UART_PRE_PREAMBLE_MASK                   This_symbol_has_been_deprecated
#define UART_PRE_PREAMBLE_SHIFT                  This_symbol_has_been_deprecated
#define UART_PRE_PREAMBLE(x)                     This_symbol_has_been_deprecated
#define UART_TPL_TPL_MASK                        This_symbol_has_been_deprecated
#define UART_TPL_TPL_SHIFT                       This_symbol_has_been_deprecated
#define UART_TPL_TPL(x)                          This_symbol_has_been_deprecated
#define UART_IE_TXFIE_MASK                       This_symbol_has_been_deprecated
#define UART_IE_TXFIE_SHIFT                      This_symbol_has_been_deprecated
#define UART_IE_PSIE_MASK                        This_symbol_has_been_deprecated
#define UART_IE_PSIE_SHIFT                       This_symbol_has_been_deprecated
#define UART_IE_PCTEIE_MASK                      This_symbol_has_been_deprecated
#define UART_IE_PCTEIE_SHIFT                     This_symbol_has_been_deprecated
#define UART_IE_PTXIE_MASK                       This_symbol_has_been_deprecated
#define UART_IE_PTXIE_SHIFT                      This_symbol_has_been_deprecated
#define UART_IE_PRXIE_MASK                       This_symbol_has_been_deprecated
#define UART_IE_PRXIE_SHIFT                      This_symbol_has_been_deprecated
#define UART_IE_ISDIE_MASK                       This_symbol_has_been_deprecated
#define UART_IE_ISDIE_SHIFT                      This_symbol_has_been_deprecated
#define UART_IE_WBEIE_MASK                       This_symbol_has_been_deprecated
#define UART_IE_WBEIE_SHIFT                      This_symbol_has_been_deprecated
#define UART_WB_WBASE_MASK                       This_symbol_has_been_deprecated
#define UART_WB_WBASE_SHIFT                      This_symbol_has_been_deprecated
#define UART_WB_WBASE(x)                         This_symbol_has_been_deprecated
#define UART_S3_TXFF_MASK                        This_symbol_has_been_deprecated
#define UART_S3_TXFF_SHIFT                       This_symbol_has_been_deprecated
#define UART_S3_PSF_MASK                         This_symbol_has_been_deprecated
#define UART_S3_PSF_SHIFT                        This_symbol_has_been_deprecated
#define UART_S3_PCTEF_MASK                       This_symbol_has_been_deprecated
#define UART_S3_PCTEF_SHIFT                      This_symbol_has_been_deprecated
#define UART_S3_PTXF_MASK                        This_symbol_has_been_deprecated
#define UART_S3_PTXF_SHIFT                       This_symbol_has_been_deprecated
#define UART_S3_PRXF_MASK                        This_symbol_has_been_deprecated
#define UART_S3_PRXF_SHIFT                       This_symbol_has_been_deprecated
#define UART_S3_ISD_MASK                         This_symbol_has_been_deprecated
#define UART_S3_ISD_SHIFT                        This_symbol_has_been_deprecated
#define UART_S3_WBEF_MASK                        This_symbol_has_been_deprecated
#define UART_S3_WBEF_SHIFT                       This_symbol_has_been_deprecated
#define UART_S3_PEF_MASK                         This_symbol_has_been_deprecated
#define UART_S3_PEF_SHIFT                        This_symbol_has_been_deprecated
#define UART_S4_FE_MASK                          This_symbol_has_been_deprecated
#define UART_S4_FE_SHIFT                         This_symbol_has_been_deprecated
#define UART_S4_ILCV_MASK                        This_symbol_has_been_deprecated
#define UART_S4_ILCV_SHIFT                       This_symbol_has_been_deprecated
#define UART_S4_CDET_MASK                        This_symbol_has_been_deprecated
#define UART_S4_CDET_SHIFT                       This_symbol_has_been_deprecated
#define UART_S4_CDET(x)                          This_symbol_has_been_deprecated
#define UART_S4_INITF_MASK                       This_symbol_has_been_deprecated
#define UART_S4_INITF_SHIFT                      This_symbol_has_been_deprecated
#define UART_RPL_RPL_MASK                        This_symbol_has_been_deprecated
#define UART_RPL_RPL_SHIFT                       This_symbol_has_been_deprecated
#define UART_RPL_RPL(x)                          This_symbol_has_been_deprecated
#define UART_RPREL_RPREL_MASK                    This_symbol_has_been_deprecated
#define UART_RPREL_RPREL_SHIFT                   This_symbol_has_been_deprecated
#define UART_RPREL_RPREL(x)                      This_symbol_has_been_deprecated
#define UART_CPW_CPW_MASK                        This_symbol_has_been_deprecated
#define UART_CPW_CPW_SHIFT                       This_symbol_has_been_deprecated
#define UART_CPW_CPW(x)                          This_symbol_has_been_deprecated
#define UART_RIDT_RIDT_MASK                      This_symbol_has_been_deprecated
#define UART_RIDT_RIDT_SHIFT                     This_symbol_has_been_deprecated
#define UART_RIDT_RIDT(x)                        This_symbol_has_been_deprecated
#define UART_TIDT_TIDT_MASK                      This_symbol_has_been_deprecated
#define UART_TIDT_TIDT_SHIFT                     This_symbol_has_been_deprecated
#define UART_TIDT_TIDT(x)                        This_symbol_has_been_deprecated
#define UART_AP7816A_T0_ADTI_H_MASK              This_symbol_has_been_deprecated
#define UART_AP7816A_T0_ADTI_H_SHIFT             This_symbol_has_been_deprecated
#define UART_AP7816A_T0_ADTI_H(x)                This_symbol_has_been_deprecated
#define UART_AP7816B_T0_ADTI_L_MASK              This_symbol_has_been_deprecated
#define UART_AP7816B_T0_ADTI_L_SHIFT             This_symbol_has_been_deprecated
#define UART_AP7816B_T0_ADTI_L(x)                This_symbol_has_been_deprecated
#define UART_WP7816A_T0_WI_H_MASK                This_symbol_has_been_deprecated
#define UART_WP7816A_T0_WI_H_SHIFT               This_symbol_has_been_deprecated
#define UART_WP7816A_T0_WI_H(x)                  This_symbol_has_been_deprecated
#define UART_WP7816B_T0_WI_L_MASK                This_symbol_has_been_deprecated
#define UART_WP7816B_T0_WI_L_SHIFT               This_symbol_has_been_deprecated
#define UART_WP7816B_T0_WI_L(x)                  This_symbol_has_been_deprecated
#define UART_WP7816A_T1_BWI_H_MASK               This_symbol_has_been_deprecated
#define UART_WP7816A_T1_BWI_H_SHIFT              This_symbol_has_been_deprecated
#define UART_WP7816A_T1_BWI_H(x)                 This_symbol_has_been_deprecated
#define UART_WP7816B_T1_BWI_L_MASK               This_symbol_has_been_deprecated
#define UART_WP7816B_T1_BWI_L_SHIFT              This_symbol_has_been_deprecated
#define UART_WP7816B_T1_BWI_L(x)                 This_symbol_has_been_deprecated
#define UART_WGP7816_T1_BGI_MASK                 This_symbol_has_been_deprecated
#define UART_WGP7816_T1_BGI_SHIFT                This_symbol_has_been_deprecated
#define UART_WGP7816_T1_BGI(x)                   This_symbol_has_been_deprecated
#define UART_WGP7816_T1_CWI1_MASK                This_symbol_has_been_deprecated
#define UART_WGP7816_T1_CWI1_SHIFT               This_symbol_has_been_deprecated
#define UART_WGP7816_T1_CWI1(x)                  This_symbol_has_been_deprecated
#define UART_WP7816C_T1_CWI2_MASK                This_symbol_has_been_deprecated
#define UART_WP7816C_T1_CWI2_SHIFT               This_symbol_has_been_deprecated
#define UART_WP7816C_T1_CWI2(x)                  This_symbol_has_been_deprecated
#define UART0_WP7816                             This_symbol_has_been_deprecated
#define UART0_C6                                 This_symbol_has_been_deprecated
#define UART0_PCTH                               This_symbol_has_been_deprecated
#define UART0_PCTL                               This_symbol_has_been_deprecated
#define UART0_B1T                                This_symbol_has_been_deprecated
#define UART0_SDTH                               This_symbol_has_been_deprecated
#define UART0_SDTL                               This_symbol_has_been_deprecated
#define UART0_PRE                                This_symbol_has_been_deprecated
#define UART0_TPL                                This_symbol_has_been_deprecated
#define UART0_IE                                 This_symbol_has_been_deprecated
#define UART0_WB                                 This_symbol_has_been_deprecated
#define UART0_S3                                 This_symbol_has_been_deprecated
#define UART0_S4                                 This_symbol_has_been_deprecated
#define UART0_RPL                                This_symbol_has_been_deprecated
#define UART0_RPREL                              This_symbol_has_been_deprecated
#define UART0_CPW                                This_symbol_has_been_deprecated
#define UART0_RIDT                               This_symbol_has_been_deprecated
#define UART0_TIDT                               This_symbol_has_been_deprecated
#define UART0_AP7816A_T0                         This_symbol_has_been_deprecated
#define UART0_AP7816B_T0                         This_symbol_has_been_deprecated
#define UART0_WP7816A_T0                         This_symbol_has_been_deprecated
#define UART0_WP7816A_T1                         This_symbol_has_been_deprecated
#define UART0_WP7816B_T0                         This_symbol_has_been_deprecated
#define UART0_WP7816B_T1                         This_symbol_has_been_deprecated
#define UART0_WGP7816_T1                         This_symbol_has_been_deprecated
#define UART0_WP7816C_T1                         This_symbol_has_been_deprecated

/*!
 * @}
 */ /* end of group Backward_Compatibility_Symbols */


#else /* #if !defined(MCU_MK21F12) */
  /* There is already included the same memory map. Check if it is compatible (has the same major version) */
  #if (MCU_MEM_MAP_VERSION != 0x0100u)
    #if (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING))
      #warning There are included two not compatible versions of memory maps. Please check possible differences.
    #endif /* (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING)) */
  #endif /* (MCU_MEM_MAP_VERSION != 0x0100u) */
#endif  /* #if !defined(MCU_MK21F12) */

/* MK21F12.h, eof. */
